witalis3/UA3REO-DDC-Transceiver/STM32/WOLF-2/Src/front_unit.c
#include "front_unit.h"
#include "agc.h"
#include "atu.h"
#include "audio_filters.h"
#include "auto_notch.h"
#include "functions.h"
#include "lcd.h"
#include "main.h"
#include "noise_reduction.h"
#include "rf_unit.h"
#include "sd.h"
#include "settings.h"
#include "stm32h7xx_hal.h"
#include "system_menu.h"
#include "trx_manager.h"
#include "vad.h"

int8_t FRONTPANEL_ProcessEncoder1 = 0;
int8_t FRONTPANEL_ProcessEncoder2 = 0;
int8_t FRONTPANEL_ProcessEncoder3 = 0;
int8_t FRONTPANEL_ProcessEncoder4 = 0;

#ifdef HRDW_MCP3008_1
bool FRONTPanel_MCP3008_1_Enabled = true;
#endif
#ifdef HRDW_MCP3008_2
bool FRONTPanel_MCP3008_2_Enabled = true;
#endif
#ifdef HRDW_MCP3008_3
bool FRONTPanel_MCP3008_3_Enabled = true;
#endif

static void FRONTPANEL_ENCODER_Rotated(float32_t direction);
static void FRONTPANEL_ENCODER2_Rotated(int8_t direction);
static void FRONTPANEL_ENCODER2_Rotated(int8_t direction);
static void FRONTPANEL_ENC2SW_click_handler(uint32_t parameter);
static void FRONTPANEL_ENC2SW_hold_handler(uint32_t parameter);
static void FRONTPANEL_ENC3SW_click_handler(uint32_t parameter);
static void FRONTPANEL_ENC3SW_hold_handler(uint32_t parameter);
static void FRONTPANEL_ENC4SW_click_handler(uint32_t parameter);
static void FRONTPANEL_ENC4SW_hold_handler(uint32_t parameter);
static uint16_t FRONTPANEL_ReadMCP3008_Value(uint8_t channel, uint8_t adc_num, uint8_t count);

static int32_t ENCODER_slowler = 0;
static uint32_t ENCODER_AValDeb = 0;
static uint32_t ENCODER2_AValDeb = 0;
static uint32_t ENCODER3_AValDeb = 0;
static uint32_t ENCODER4_AValDeb = 0;

PERIPH_FrontPanel_Button PERIPH_FrontPanel_Buttons[] = {
    // buttons
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 15, .tres_max = 77, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 77, .tres_max = 170, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 170, .tres_max = 263, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 263, .tres_max = 369, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 369, .tres_max = 449, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 449, .tres_max = 543, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 543, .tres_max = 636, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 636, .tres_max = 729, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 729, .tres_max = 822, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 0, .type = FUNIT_CTRL_BUTTON, .tres_min = 822, .tres_max = 884, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED

    {.port = 1,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 15,
     .tres_max = 77,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = FRONTPANEL_ENC4SW_click_handler,
     .holdHandler = FRONTPANEL_ENC4SW_hold_handler},
    //{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 77, .tres_max = 170, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 170, .tres_max = 263, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    {.port = 1,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 263,
     .tres_max = 369,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_RIGHT_ARR,
     .holdHandler = BUTTONHANDLER_LEFT_ARR}, // F
    {.port = 1,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 369,
     .tres_max = 449,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MUTE,
     .holdHandler = BUTTONHANDLER_MUTE_AFAMP},
    //{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 449, .tres_max = 543, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 543, .tres_max = 636, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    //{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 636, .tres_max = 729, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED
    {.port = 1,
     .channel = 1,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 729,
     .tres_max = 822,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_ANT,
     .holdHandler = BUTTONHANDLER_ANT},
    //{.port = 1, .channel = 1, .type = FUNIT_CTRL_BUTTON, .tres_min = 822, .tres_max = 884, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, // RESERVED

    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 15,
     .tres_max = 77,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_160m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 77,
     .tres_max = 170,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_80m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 170,
     .tres_max = 263,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_40m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 263,
     .tres_max = 369,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_30m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 369,
     .tres_max = 449,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_20m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 449,
     .tres_max = 543,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_17m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 543,
     .tres_max = 636,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_15m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 636,
     .tres_max = 729,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_12m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 729,
     .tres_max = 822,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_10m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 822,
     .tres_max = 884,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = BANDID_2m,
     .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY,
     .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},

    {.port = 1, .channel = 3, .type = FUNIT_CTRL_AF_GAIN}, // AF GAIN
    {.port = 1, .channel = 4, .type = FUNIT_CTRL_IF_GAIN}, // IF GAIN
    {.port = 1, .channel = 5, .type = FUNIT_CTRL_RIT},     // RIT

    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 15,
     .tres_max = 77,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MENU,
     .holdHandler = BUTTONHANDLER_MENUHOLD},
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 77,
     .tres_max = 170,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_RIT,
     .holdHandler = BUTTONHANDLER_XIT},
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 170,
     .tres_max = 263,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_MODE_P,
     .holdHandler = BUTTONHANDLER_MODE_N},
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 263,
     .tres_max = 369,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = FRONTPANEL_ENC2SW_click_handler,
     .holdHandler = FRONTPANEL_ENC2SW_hold_handler},
    //{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 369, .tres_max = 449, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = ,
    //.holdHandler = }, //RESERVED
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 449,
     .tres_max = 543,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_LOCK,
     .holdHandler = BUTTONHANDLER_LOCK},
    {.port = 1, .channel = 6, .type = FUNIT_CTRL_PTT, .tres_min = 543, .tres_max = 636, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0},
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 636,
     .tres_max = 729,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_AsB,
     .holdHandler = BUTTONHANDLER_ArB},
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 729,
     .tres_max = 822,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 8,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 6,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 822,
     .tres_max = 884,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_VOX,
     .holdHandler = BUTTONHANDLER_VOX},

    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 15,
     .tres_max = 77,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 77,
     .tres_max = 170,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 1,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 170,
     .tres_max = 263,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 2,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 263,
     .tres_max = 369,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 3,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 369,
     .tres_max = 449,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 4,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 449,
     .tres_max = 543,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 5,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 543,
     .tres_max = 636,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 6,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 636,
     .tres_max = 729,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 7,
     .clickHandler = BUTTONHANDLER_FUNC,
     .holdHandler = BUTTONHANDLER_FUNCH},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 729,
     .tres_max = 822,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_TUNE,
     .holdHandler = BUTTONHANDLER_TUNE},
    {.port = 1,
     .channel = 7,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 822,
     .tres_max = 884,
     .state = false,
     .prev_state = false,
     .work_in_menu = true,
     .parameter = 0,
     .clickHandler = FRONTPANEL_ENC3SW_click_handler,
     .holdHandler = FRONTPANEL_ENC3SW_hold_handler},
};

const PERIPH_FrontPanel_FuncButton PERIPH_FrontPanel_FuncButtonsList[FUNCBUTTONS_COUNT] = {
    {.name = "A / B", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AsB, .holdHandler = BUTTONHANDLER_AsB, .checkBool = NULL},
    {.name = "B=A", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ArB, .holdHandler = BUTTONHANDLER_ArB, .checkBool = NULL},
    {.name = "POWER", .work_in_menu = true, .clickHandler = BUTTONHANDLER_RF_POWER, .holdHandler = BUTTONHANDLER_RF_POWER, .checkBool = NULL},
    {.name = "DOUBLE", .work_in_menu = false, .clickHandler = BUTTONHANDLER_DOUBLE, .holdHandler = BUTTONHANDLER_DOUBLEMODE, .checkBool = (uint32_t *)&TRX.Dual_RX},
    {.name = "XIT", .work_in_menu = true, .clickHandler = BUTTONHANDLER_XIT, .holdHandler = BUTTONHANDLER_XIT, .checkBool = (uint32_t *)&TRX.XIT_Enabled},
    {.name = "RIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_RIT, .holdHandler = BUTTONHANDLER_RIT, .checkBool = (uint32_t *)&TRX.RIT_Enabled},
    {.name = "CQ", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CQ, .holdHandler = BUTTONHANDLER_FILEMANAGER, .checkBool = (uint32_t *)&SD_PlayInProcess},
    {.name = "REC", .work_in_menu = false, .clickHandler = BUTTONHANDLER_REC, .holdHandler = BUTTONHANDLER_REC, .checkBool = (uint32_t *)&SD_RecordInProcess},
    {.name = "SERVICE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SERVICES, .holdHandler = BUTTONHANDLER_SCREENSHOT, .checkBool = NULL},

    {.name = "SAMPL-", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SAMPLE_N, .holdHandler = BUTTONHANDLER_SAMPLE_N, .checkBool = NULL},
    {.name = "SAMPL+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SAMPLE_P, .holdHandler = BUTTONHANDLER_SAMPLE_P, .checkBool = NULL},
    {.name = "ZOOM-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_N, .holdHandler = BUTTONHANDLER_ZOOM_N, .checkBool = NULL},
    {.name = "ZOOM+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_P, .holdHandler = BUTTONHANDLER_ZOOM_P, .checkBool = NULL},
    {.name = "SNAP <", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SNAP_LEFT, .holdHandler = BUTTONHANDLER_AUTO_SNAP, .checkBool = (uint32_t *)&TRX.Auto_Snap},
    {.name = "SNAP >", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SNAP_RIGHT, .holdHandler = BUTTONHANDLER_AUTO_SNAP, .checkBool = (uint32_t *)&TRX.Auto_Snap},
    {.name = "SPLIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SPLIT, .holdHandler = BUTTONHANDLER_SPLIT, .checkBool = (uint32_t *)&TRX.SPLIT_Enabled},
    {.name = "WPM", .work_in_menu = true, .clickHandler = BUTTONHANDLER_WPM, .holdHandler = BUTTONHANDLER_WPM, .checkBool = NULL},
    {.name = "TUNE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_TUNE, .holdHandler = BUTTONHANDLER_TUNE, .checkBool = (uint32_t *)&TRX_Tune},

    {.name = "SCAN", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SCAN, .holdHandler = BUTTONHANDLER_SCAN, .checkBool = (uint32_t *)&TRX_ScanMode},
    {.name = "HPF", .work_in_menu = true, .clickHandler = BUTTONHANDLER_HPF, .holdHandler = BUTTONHANDLER_HPF, .checkBool = NULL},
    {.name = "MODE+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_MODE_P, .holdHandler = BUTTONHANDLER_MODE_P, .checkBool = NULL},
    {.name = "MODE-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_MODE_N, .holdHandler = BUTTONHANDLER_MODE_N, .checkBool = NULL},
    {.name = "BAND-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BAND_N, .holdHandler = BUTTONHANDLER_BAND_N, .checkBool = NULL},
    {.name = "BAND+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BAND_P, .holdHandler = BUTTONHANDLER_BAND_P, .checkBool = NULL},
    {.name = "BANDMP", .work_in_menu = false, .clickHandler = BUTTONHANDLER_BANDMAP, .holdHandler = BUTTONHANDLER_BANDMAP, .checkBool = (uint32_t *)&TRX.BandMapEnabled},
    {.name = "AUTOGN", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AUTOGAINER, .holdHandler = BUTTONHANDLER_AUTOGAINER, .checkBool = (uint32_t *)&TRX.AutoGain},
    {.name = "LOCK", .work_in_menu = true, .clickHandler = BUTTONHANDLER_LOCK, .holdHandler = BUTTONHANDLER_LOCK, .checkBool = (uint32_t *)&TRX.Locked},

    // hidden entry for menu editor
    {.name = "MENU", .work_in_menu = true, .clickHandler = BUTTONHANDLER_MENU, .holdHandler = BUTTONHANDLER_MENU, .checkBool = NULL},
    {.name = "FT8", .work_in_menu = false, .clickHandler = BUTTONHANDLER_FT8, .holdHandler = BUTTONHANDLER_FT8, .checkBool = NULL},
    {.name = "SQL", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SQUELCH, .holdHandler = BUTTONHANDLER_SQUELCH, .checkBool = (uint32_t *)&TRX.SQL_shadow},
    {.name = "VOX", .work_in_menu = true, .clickHandler = BUTTONHANDLER_VOX, .holdHandler = BUTTONHANDLER_VOX, .checkBool = (uint32_t *)&TRX.VOX},
    {.name = "FILES", .work_in_menu = false, .clickHandler = BUTTONHANDLER_FILEMANAGER, .holdHandler = BUTTONHANDLER_FILEMANAGER, .checkBool = NULL},
    {.name = "ANT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ANT, .holdHandler = BUTTONHANDLER_ANT, .checkBool = NULL},
    {.name = "CESSB", .work_in_menu = false, .clickHandler = BUTTONHANDLER_CESSB, .holdHandler = BUTTONHANDLER_CESSB, .checkBool = (uint32_t *)&TRX.TX_CESSB},
};

PERIPH_FrontPanel_Button PERIPH_FrontPanel_TANGENT_MH36[] = {
    {.port = 1, .channel = 2, .type = FUNIT_CTRL_PTT, .tres_min = 200, .tres_max = 430}, // PTT_SW1 - PTT
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 430,
     .tres_max = 640,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_DOWN,
     .holdHandler = BUTTONHANDLER_DOWN}, // PTT_SW1 - DOWN
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 640,
     .tres_max = 805,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_UP,
     .holdHandler = BUTTONHANDLER_UP}, // PTT_SW1 - UP
    {.port = 1,
     .channel = 2,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 805,
     .tres_max = 920,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_AGC,
     .holdHandler = BUTTONHANDLER_AGC}, // PTT_SW1 - AGC
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 200,
     .tres_max = 430,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_AsB,
     .holdHandler = BUTTONHANDLER_ArB}, // PTT_SW2 - VFO
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 430,
     .tres_max = 640,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_BAND_N,
     .holdHandler = BUTTONHANDLER_MODE_N}, // PTT_SW2 - P1
    {.port = 1,
     .channel = 3,
     .type = FUNIT_CTRL_BUTTON,
     .tres_min = 640,
     .tres_max = 805,
     .state = false,
     .prev_state = false,
     .work_in_menu = false,
     .parameter = 0,
     .clickHandler = BUTTONHANDLER_BAND_P,
     .holdHandler = BUTTONHANDLER_MODE_P}, // PTT_SW2 - P2
};

